frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.c
volatile FCNFGSTR _FCNFG;                                  /* Flash Configuration Register */
volatile FDATAHISTR _FDATAHI;                              /* Flash Data High Register */
volatile FDATALOSTR _FDATALO;                              /* Flash Data Low Register */
volatile FPROTSTR _FPROT;                                  /* Flash Protection Register */
volatile FSECSTR _FSEC;                                    /* Flash Security Register */
volatile FSTATSTR _FSTAT;                                  /* Flash Status Register */
volatile GPAGESTR _GPAGE;                                  /* Global Page Index Register */
volatile ICOVWSTR _ICOVW;                                  /* Input Control Overwrite Register */
volatile ICPARSTR _ICPAR;                                  /* Input Control Pulse Accumulator Register */
volatile ICSYSSTR _ICSYS;                                  /* Input Control System Control Register */
volatile IIC0_IBADSTR _IIC0_IBAD;                          /* IIC 0 Address Register */
volatile IIC0_IBCRSTR _IIC0_IBCR;                          /* IIC 0 Control Register */
volatile IIC0_IBDRSTR _IIC0_IBDR;                          /* IIC 0 Data I/O Register */
volatile IIC0_IBFDSTR _IIC0_IBFD;                          /* IIC 0 Frequency Divider Register */
volatile IIC0_IBSRSTR _IIC0_IBSR;                          /* IIC 0 Status Register */
volatile IIC1_IBADSTR _IIC1_IBAD;                          /* IIC 1 Address Register */
volatile IIC1_IBCRSTR _IIC1_IBCR;                          /* IIC 1 Control Register */
volatile IIC1_IBDRSTR _IIC1_IBDR;                          /* IIC 1 Data I/O Register */
volatile IIC1_IBFDSTR _IIC1_IBFD;                          /* IIC 1 Frequency Divider Register */
volatile IIC1_IBSRSTR _IIC1_IBSR;                          /* IIC 1 Status Register */
volatile INT_CFADDRSTR _INT_CFADDR;                        /* Interrupt Configuration Address Register */
volatile INT_CFDATA0STR _INT_CFDATA0;                      /* Interrupt Configuration Data Register 0 */
volatile INT_CFDATA1STR _INT_CFDATA1;                      /* Interrupt Configuration Data Register 1 */
volatile INT_CFDATA2STR _INT_CFDATA2;                      /* Interrupt Configuration Data Register 2 */
volatile INT_CFDATA3STR _INT_CFDATA3;                      /* Interrupt Configuration Data Register 3 */
volatile INT_CFDATA4STR _INT_CFDATA4;                      /* Interrupt Configuration Data Register 4 */
volatile INT_CFDATA5STR _INT_CFDATA5;                      /* Interrupt Configuration Data Register 5 */
volatile INT_CFDATA6STR _INT_CFDATA6;                      /* Interrupt Configuration Data Register 6 */
volatile INT_CFDATA7STR _INT_CFDATA7;                      /* Interrupt Configuration Data Register 7 */
volatile INT_XGPRIOSTR _INT_XGPRIO;                        /* XGATE Interrupt Priority Configuration Register */
volatile IRQCRSTR _IRQCR;                                  /* Interrupt Control Register */
volatile IVBRSTR _IVBR;                                    /* Interrupt Vector Base Register */
volatile MCCTLSTR _MCCTL;                                  /* Modulus Down Counter underflow */
volatile MCFLGSTR _MCFLG;                                  /* 16-Bit Modulus Down Counter Flag Register */
volatile MISCSTR _MISC;                                    /* Miscellaneous System Control Register */
volatile MODESTR _MODE;                                    /* Mode Register */
volatile MODRRSTR _MODRR;                                  /* Module Routing Register */
volatile OC7DSTR _OC7D;                                    /* Output Compare 7 Data Register */
volatile OC7MSTR _OC7M;                                    /* Output Compare 7 Mask Register */
volatile PACTLSTR _PACTL;                                  /* 16-Bit Pulse Accumulator A Control Register */
volatile PAFLGSTR _PAFLG;                                  /* Pulse Accumulator A Flag Register */
volatile PARTIDHSTR _PARTIDH;                              /* Part ID Register High */
volatile PARTIDLSTR _PARTIDL;                              /* Part ID Register Low */
volatile PBCTLSTR _PBCTL;                                  /* 16-Bit Pulse Accumulator B Control Register */
volatile PBFLGSTR _PBFLG;                                  /* Pulse Accumulator B Flag Register */
volatile PER0AD1STR _PER0AD1;                              /* Port AD1 Pull Up Enable Register 0 */
volatile PER1AD0STR _PER1AD0;                              /* Port AD0 Pull Up Enable Register 1 */
volatile PER1AD1STR _PER1AD1;                              /* Port AD1 Pull Up Enable Register 1 */
volatile PERHSTR _PERH;                                    /* Port H Pull Device Enable Register */
volatile PERJSTR _PERJ;                                    /* Port J Pull Device Enable Register */
volatile PERMSTR _PERM;                                    /* Port M Pull Device Enable Register */
volatile PERPSTR _PERP;                                    /* Port P Pull Device Enable Register */
volatile PERSSTR _PERS;                                    /* Port S Pull Device Enable Register */
volatile PERTSTR _PERT;                                    /* Port T Pull Device Enable Register */
volatile PIEHSTR _PIEH;                                    /* Port H Interrupt Enable Register */
volatile PIEJSTR _PIEJ;                                    /* Port J Interrupt Enable Register */
volatile PIEPSTR _PIEP;                                    /* Port P Interrupt Enable Register */
volatile PIFHSTR _PIFH;                                    /* Port H Interrupt Flag Register */
volatile PIFJSTR _PIFJ;                                    /* Port J Interrupt Flag Register */
volatile PIFPSTR _PIFP;                                    /* Port P Interrupt Flag Register */
volatile PITCESTR _PITCE;                                  /* PIT Channel Enable Register */
volatile PITCFLMTSTR _PITCFLMT;                            /* PIT Control and Force Load Micro Timer Register */
volatile PITFLTSTR _PITFLT;                                /* PIT Force Load Timer Register */
volatile PITINTESTR _PITINTE;                              /* PIT Interrupt Enable Register */
volatile PITMTLD0STR _PITMTLD0;                            /* PIT Micro Timer Load Register 0 */
volatile PITMTLD1STR _PITMTLD1;                            /* PIT Micro Timer Load Register 1 */
volatile PITMUXSTR _PITMUX;                                /* PIT Multiplex Register */
volatile PITTFSTR _PITTF;                                  /* PIT Time-out Flag Register */
volatile PLLCTLSTR _PLLCTL;                                /* CRG PLL Control Register */
volatile PORTESTR _PORTE;                                  /* Port E Register */
volatile PORTKSTR _PORTK;                                  /* Port K Data Register */
volatile PPAGESTR _PPAGE;                                  /* Program Page Index Register */
volatile PPSHSTR _PPSH;                                    /* Port H Polarity Select Register */
volatile PPSJSTR _PPSJ;                                    /* Port J Polarity Select Register */
volatile PPSMSTR _PPSM;                                    /* Port M Polarity Select Register */
volatile PPSPSTR _PPSP;                                    /* Port P Polarity Select Register */
volatile PPSSSTR _PPSS;                                    /* Port S Polarity Select Register */
volatile PPSTSTR _PPST;                                    /* Port T Polarity Select Register */
volatile PT0AD1STR _PT0AD1;                                /* Port AD1 Data Register 0 */
volatile PT1AD0STR _PT1AD0;                                /* Port AD0 Data Register 1 */
volatile PT1AD1STR _PT1AD1;                                /* Port AD1 Data Register 1 */
volatile PTHSTR _PTH;                                      /* Port H I/O Register */
volatile PTIHSTR _PTIH;                                    /* Port H Input Register */
volatile PTIJSTR _PTIJ;                                    /* Port J Input Register */
volatile PTIMSTR _PTIM;                                    /* Port M Input Register */
volatile PTIPSTR _PTIP;                                    /* Port P Input Register */
volatile PTISSTR _PTIS;                                    /* Port S Input Register */
volatile PTITSTR _PTIT;                                    /* Port T Input Register */
volatile PTJSTR _PTJ;                                      /* Port J I/O Register */
volatile PTMSTR _PTM;                                      /* Port M I/O Register */
volatile PTMCPSRSTR _PTMCPSR;                              /* Precision Timer Modulus Counter Prescaler Select Register */
volatile PTPSTR _PTP;                                      /* Port P I/O Register */
volatile PTPSRSTR _PTPSR;                                  /* Precision Timer Prescaler Select */
volatile PTSSTR _PTS;                                      /* Port S I/O Register */
volatile PTTSTR _PTT;                                      /* Port T I/O Register */
volatile PUCRSTR _PUCR;                                    /* Pull-Up Control Register */
volatile PWMCAESTR _PWMCAE;                                /* PWM Center Align Enable Register */
volatile PWMCLKSTR _PWMCLK;                                /* PWM Clock Select Register */
volatile PWMCTLSTR _PWMCTL;                                /* PWM Control Register */
volatile PWMESTR _PWME;                                    /* PWM Enable Register */
volatile PWMPOLSTR _PWMPOL;                                /* PWM Polarity Register */
volatile PWMPRCLKSTR _PWMPRCLK;                            /* PWM Prescale Clock Select Register */
volatile PWMSCLASTR _PWMSCLA;                              /* PWM Scale A Register */
volatile PWMSCLBSTR _PWMSCLB;                              /* PWM Scale B Register */
volatile PWMSDNSTR _PWMSDN;                                /* PWM Shutdown Register */
volatile RDR0AD1STR _RDR0AD1;                              /* Port AD1 Reduced Drive Register 0 */
volatile RDR1AD0STR _RDR1AD0;                              /* Port AD0 Reduced Drive Register 1 */
volatile RDR1AD1STR _RDR1AD1;                              /* Port AD1 Reduced Drive Register 1 */
volatile RDRHSTR _RDRH;                                    /* Port H Reduced Drive Register */
volatile RDRIVSTR _RDRIV;                                  /* Reduced Drive of I/O Lines */
volatile RDRJSTR _RDRJ;                                    /* Port J Reduced Drive Register */
volatile RDRMSTR _RDRM;                                    /* Port M Reduced Drive Register */
volatile RDRPSTR _RDRP;                                    /* Port P Reduced Drive Register */
volatile RDRSSTR _RDRS;                                    /* Port S Reduced Drive Register */
volatile RDRTSTR _RDRT;                                    /* Port T Reduced Drive Register */
volatile REFDVSTR _REFDV;                                  /* CRG Reference Divider Register */
volatile RPAGESTR _RPAGE;                                  /* RAM Page Index Register */
volatile RTICTLSTR _RTICTL;                                /* CRG RTI Control Register */
volatile SCI0ASR1STR _SCI0ASR1;                            /* SCI 0 Alternative Status Register 1 */
volatile SCI0CR2STR _SCI0CR2;                              /* SCI 0 Control Register 2 */
volatile SCI0DRHSTR _SCI0DRH;                              /* SCI 0 Data Register High */
volatile SCI0DRLSTR _SCI0DRL;                              /* SCI 0 Data Register Low */
volatile SCI0SR1STR _SCI0SR1;                              /* SCI 0 Status Register 1 */
volatile SCI0SR2STR _SCI0SR2;                              /* SCI 0 Status Register 2 */
volatile SCI1ASR1STR _SCI1ASR1;                            /* SCI 1 Alternative Status Register 1 */
volatile SCI1CR2STR _SCI1CR2;                              /* SCI 1 Control Register 2 */
volatile SCI1DRHSTR _SCI1DRH;                              /* SCI 1 Data Register High */
volatile SCI1DRLSTR _SCI1DRL;                              /* SCI 1 Data Register Low */
volatile SCI1SR1STR _SCI1SR1;                              /* SCI 1 Status Register 1 */
volatile SCI1SR2STR _SCI1SR2;                              /* SCI 1 Status Register 2 */
volatile SCI2ASR1STR _SCI2ASR1;                            /* SCI 2 Alternative Status Register 1 */
volatile SCI2CR2STR _SCI2CR2;                              /* SCI 2 Control Register 2 */
volatile SCI2DRHSTR _SCI2DRH;                              /* SCI 2 Data Register High */
volatile SCI2DRLSTR _SCI2DRL;                              /* SCI 2 Data Register Low */
volatile SCI2SR1STR _SCI2SR1;                              /* SCI 2 Status Register 1 */
volatile SCI2SR2STR _SCI2SR2;                              /* SCI 2 Status Register 2 */
volatile SCI3ASR1STR _SCI3ASR1;                            /* SCI 3 Alternative Status Register 1 */
volatile SCI3CR2STR _SCI3CR2;                              /* SCI 3 Control Register 2 */
volatile SCI3DRHSTR _SCI3DRH;                              /* SCI 3 Data Register High */
volatile SCI3DRLSTR _SCI3DRL;                              /* SCI 3 Data Register Low */
volatile SCI3SR1STR _SCI3SR1;                              /* SCI 3 Status Register 1 */
volatile SCI3SR2STR _SCI3SR2;                              /* SCI 3 Status Register 2 */
volatile SCI4ASR1STR _SCI4ASR1;                            /* SCI 4 Alternative Status Register 1 */
volatile SCI4CR2STR _SCI4CR2;                              /* SCI 4 Control Register 2 */
volatile SCI4DRHSTR _SCI4DRH;                              /* SCI 4 Data Register High */
volatile SCI4DRLSTR _SCI4DRL;                              /* SCI 4 Data Register Low */
volatile SCI4SR1STR _SCI4SR1;                              /* SCI 4 Status Register 1 */
volatile SCI4SR2STR _SCI4SR2;                              /* SCI 4 Status Register 2 */
volatile SCI5ASR1STR _SCI5ASR1;                            /* SCI 5 Alternative Status Register 1 */
volatile SCI5CR2STR _SCI5CR2;                              /* SCI 5 Control Register 2 */
volatile SCI5DRHSTR _SCI5DRH;                              /* SCI 5 Data Register High */
volatile SCI5DRLSTR _SCI5DRL;                              /* SCI 5 Data Register Low */
volatile SCI5SR1STR _SCI5SR1;                              /* SCI 5 Status Register 1 */
volatile SCI5SR2STR _SCI5SR2;                              /* SCI 5 Status Register 2 */
volatile SPI0BRSTR _SPI0BR;                                /* SPI 0 Baud Rate Register */
volatile SPI0CR1STR _SPI0CR1;                              /* SPI 0 Control Register */
volatile SPI0CR2STR _SPI0CR2;                              /* SPI 0 Control Register 2 */
volatile SPI0DRSTR _SPI0DR;                                /* SPI 0 Data Register */
volatile SPI0SRSTR _SPI0SR;                                /* SPI 0 Status Register */
volatile SPI1BRSTR _SPI1BR;                                /* SPI 1 Baud Rate Register */
volatile SPI1CR1STR _SPI1CR1;                              /* SPI 1 Control Register */
volatile SPI1CR2STR _SPI1CR2;                              /* SPI 1 Control Register 2 */
volatile SPI1DRSTR _SPI1DR;                                /* SPI 1 Data Register */
volatile SPI1SRSTR _SPI1SR;                                /* SPI 1 Status Register */
volatile SPI2BRSTR _SPI2BR;                                /* SPI 2 Baud Rate Register */
volatile SPI2CR1STR _SPI2CR1;                              /* SPI 2 Control Register */
volatile SPI2CR2STR _SPI2CR2;                              /* SPI 2 Control Register 2 */
volatile SPI2DRSTR _SPI2DR;                                /* SPI 2 Data Register */
volatile SPI2SRSTR _SPI2SR;                                /* SPI 2 Status Register */
volatile SYNRSTR _SYNR;                                    /* CRG Synthesizer Register */
volatile TCTL1STR _TCTL1;                                  /* Timer Control Register 1 */
volatile TCTL2STR _TCTL2;                                  /* Timer Control Register 2 */
volatile TCTL3STR _TCTL3;                                  /* Timer Control Register 3 */
volatile TCTL4STR _TCTL4;                                  /* Timer Control Register 4 */
volatile TFLG1STR _TFLG1;                                  /* Main Timer Interrupt Flag 1 */
volatile TFLG2STR _TFLG2;                                  /* Main Timer Interrupt Flag 2 */
volatile TIESTR _TIE;                                      /* Timer Interrupt Enable Register */
volatile TIOSSTR _TIOS;                                    /* Timer Input Capture/Output Compare Select */
volatile TSCR1STR _TSCR1;                                  /* Timer System Control Register1 */
volatile TSCR2STR _TSCR2;                                  /* Timer System Control Register 2 */
volatile TTOVSTR _TTOV;                                    /* Timer Toggle On Overflow Register */
volatile VREGAPICLSTR _VREGAPICL;                          /* VREG_3V3 - Autonomous Periodical Interrupt Control Register */
volatile VREGAPITRSTR _VREGAPITR;                          /* VREG_3V3 - Autonomous Periodical Interrupt Trimming Register */
volatile VREGCTRLSTR _VREGCTRL;                            /* VREG_3V3 - Control Register */
volatile WOMMSTR _WOMM;                                    /* Port M Wired-Or Mode Register */
volatile WOMSSTR _WOMS;                                    /* Port S Wired-Or Mode Register */
volatile XGCHIDSTR _XGCHID;                                /* XGATE Channel ID Register */
volatile XGMCTLSTR _XGMCTL;                                /* XGATE Module Control Register */
volatile XSCTRLSTR _XSCTRL;                                /* XSRAM Control Register */
volatile XSSRLBSTR _XSSRLB;                                /* XSRAM XGATE Code Region Lower Boundary Register */
volatile XSSRUBSTR _XSSRUB;                                /* XSRAM Shared Region Upper Boundary Register */
volatile XSXCUBSTR _XSXCUB;                                /* XSRAM XGATE Code Region Upper Boundary Register */


