frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.c
/* * * * *  16-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile ATD0CTL01STR _ATD0CTL01;                          /* ATD 0 Control Register 01 */
volatile ATD0CTL23STR _ATD0CTL23;                          /* ATD 0 Control Register 23 */
volatile ATD0CTL45STR _ATD0CTL45;                          /* ATD 0 Control Register 45 */
volatile ATD0DR0STR _ATD0DR0;                              /* ATD 0 Conversion Result Register 0 */
volatile ATD0DR1STR _ATD0DR1;                              /* ATD 0 Conversion Result Register 1 */
volatile ATD0DR2STR _ATD0DR2;                              /* ATD 0 Conversion Result Register 2 */
volatile ATD0DR3STR _ATD0DR3;                              /* ATD 0 Conversion Result Register 3 */
volatile ATD0DR4STR _ATD0DR4;                              /* ATD 0 Conversion Result Register 4 */
volatile ATD0DR5STR _ATD0DR5;                              /* ATD 0 Conversion Result Register 5 */
volatile ATD0DR6STR _ATD0DR6;                              /* ATD 0 Conversion Result Register 6 */
volatile ATD0DR7STR _ATD0DR7;                              /* ATD 0 Conversion Result Register 7 */
volatile ATD1CTL01STR _ATD1CTL01;                          /* ATD 1 Control Register 01 */
volatile ATD1CTL23STR _ATD1CTL23;                          /* ATD 1 Control Register 23 */
volatile ATD1CTL45STR _ATD1CTL45;                          /* ATD 1 Control Register 45 */
volatile ATD1DR0STR _ATD1DR0;                              /* ATD 1 Conversion Result Register 0 */
volatile ATD1DR1STR _ATD1DR1;                              /* ATD 1 Conversion Result Register 1 */
volatile ATD1DR10STR _ATD1DR10;                            /* ATD 1 Conversion Result Register 10 */
volatile ATD1DR11STR _ATD1DR11;                            /* ATD 1 Conversion Result Register 11 */
volatile ATD1DR12STR _ATD1DR12;                            /* ATD 1 Conversion Result Register 12 */
volatile ATD1DR13STR _ATD1DR13;                            /* ATD 1 Conversion Result Register 13 */
volatile ATD1DR14STR _ATD1DR14;                            /* ATD 1 Conversion Result Register 14 */
volatile ATD1DR15STR _ATD1DR15;                            /* ATD 1 Conversion Result Register 15 */
volatile ATD1DR2STR _ATD1DR2;                              /* ATD 1 Conversion Result Register 2 */
volatile ATD1DR3STR _ATD1DR3;                              /* ATD 1 Conversion Result Register 3 */
volatile ATD1DR4STR _ATD1DR4;                              /* ATD 1 Conversion Result Register 4 */
volatile ATD1DR5STR _ATD1DR5;                              /* ATD 1 Conversion Result Register 5 */
volatile ATD1DR6STR _ATD1DR6;                              /* ATD 1 Conversion Result Register 6 */
volatile ATD1DR7STR _ATD1DR7;                              /* ATD 1 Conversion Result Register 7 */
volatile ATD1DR8STR _ATD1DR8;                              /* ATD 1 Conversion Result Register 8 */
volatile ATD1DR9STR _ATD1DR9;                              /* ATD 1 Conversion Result Register 9 */
volatile CAN0RXTSRSTR _CAN0RXTSR;                          /* MSCAN 0 Receive Time Stamp Register */
volatile CAN0TXTSRSTR _CAN0TXTSR;                          /* MSCAN 0 Transmit Time Stamp Register */
volatile CAN1RXTSRSTR _CAN1RXTSR;                          /* MSCAN 1 Receive Time Stamp Register */
volatile CAN1TXTSRSTR _CAN1TXTSR;                          /* MSCAN 1 Transmit Time Stamp Register */
volatile CAN4RXTSRSTR _CAN4RXTSR;                          /* MSCAN 4 Receive Time Stamp Register */
volatile CAN4TXTSRSTR _CAN4TXTSR;                          /* MSCAN 4 Transmit Time Stamp Register */
volatile DBGTBSTR _DBGTB;                                  /* Debug Trace Buffer Register */
volatile DDRABSTR _DDRAB;                                  /* Port AB Data Direction */
volatile DDRCDSTR _DDRCD;                                  /* Port CD Data Direction */
volatile MCCNTSTR _MCCNT;                                  /* Modulus Down-Counter Count Register */
volatile PA10HSTR _PA10H;                                  /* 8-Bit Pulse Accumulators Holding 10 Register */
volatile PA32HSTR _PA32H;                                  /* 8-Bit Pulse Accumulators Holding 32 Register */
volatile PACN10STR _PACN10;                                /* Pulse Accumulators Count 10 Register */
volatile PACN32STR _PACN32;                                /* Pulse Accumulators Count 32 Register */
volatile PITCNT0STR _PITCNT0;                              /* PIT Count Register 0 */
volatile PITCNT1STR _PITCNT1;                              /* PIT Count Register 1 */
volatile PITCNT2STR _PITCNT2;                              /* PIT Count Register 2 */
volatile PITCNT3STR _PITCNT3;                              /* PIT Count Register 3 */
volatile PITLD0STR _PITLD0;                                /* PIT Load Register 0 */
volatile PITLD1STR _PITLD1;                                /* PIT Load Register 1 */
volatile PITLD2STR _PITLD2;                                /* PIT Load Register 2 */
volatile PITLD3STR _PITLD3;                                /* PIT Load Register 3 */
volatile PORTABSTR _PORTAB;                                /* Port AB */
volatile PORTCDSTR _PORTCD;                                /* Port CD */
volatile PWMCNT01STR _PWMCNT01;                            /* PWM Channel Counter 01 Register */
volatile PWMCNT23STR _PWMCNT23;                            /* PWM Channel Counter 23 Register */
volatile PWMCNT45STR _PWMCNT45;                            /* PWM Channel Counter 45 Register */
volatile PWMCNT67STR _PWMCNT67;                            /* PWM Channel Counter 67 Register */
volatile PWMDTY01STR _PWMDTY01;                            /* PWM Channel Duty 01 Register */
volatile PWMDTY23STR _PWMDTY23;                            /* PWM Channel Duty 23 Register */
volatile PWMDTY45STR _PWMDTY45;                            /* PWM Channel Duty 45 Register */
volatile PWMDTY67STR _PWMDTY67;                            /* PWM Channel Duty 67 Register */
volatile PWMPER01STR _PWMPER01;                            /* PWM Channel Period 01 Register */
volatile PWMPER23STR _PWMPER23;                            /* PWM Channel Period 23 Register */
volatile PWMPER45STR _PWMPER45;                            /* PWM Channel Period 45 Register */
volatile PWMPER67STR _PWMPER67;                            /* PWM Channel Period 67 Register */
volatile SCI0BDSTR _SCI0BD;                                /* SCI 0 Baud Rate Register */
volatile SCI1BDSTR _SCI1BD;                                /* SCI 1 Baud Rate Register */
volatile SCI2BDSTR _SCI2BD;                                /* SCI 2 Baud Rate Register */
volatile SCI3BDSTR _SCI3BD;                                /* SCI 3 Baud Rate Register */
volatile SCI4BDSTR _SCI4BD;                                /* SCI 4 Baud Rate Register */
volatile SCI5BDSTR _SCI5BD;                                /* SCI 5 Baud Rate Register */
volatile TC0STR _TC0;                                      /* Timer Input Capture/Output Compare Register 0 */
volatile TC0HSTR _TC0H;                                    /* Timer Input Capture Holding Registers 0 */
volatile TC1STR _TC1;                                      /* Timer Input Capture/Output Compare Register 1 */
volatile TC1HSTR _TC1H;                                    /* Timer Input Capture Holding Registers 1 */
volatile TC2STR _TC2;                                      /* Timer Input Capture/Output Compare Register 2 */
volatile TC2HSTR _TC2H;                                    /* Timer Input Capture Holding Registers 2 */
volatile TC3STR _TC3;                                      /* Timer Input Capture/Output Compare Register 3 */
volatile TC3HSTR _TC3H;                                    /* Timer Input Capture Holding Registers 3 */
volatile TC4STR _TC4;                                      /* Timer Input Capture/Output Compare Register 4 */
volatile TC5STR _TC5;                                      /* Timer Input Capture/Output Compare Register 5 */
volatile TC6STR _TC6;                                      /* Timer Input Capture/Output Compare Register 6 */
volatile TC7STR _TC7;                                      /* Timer Input Capture/Output Compare Register 7 */
volatile TCNTSTR _TCNT;                                    /* Timer Count Register */
volatile XGIF0STR _XGIF0;                                  /* XGATE Channel Interrupt Flag Vector 0 */
volatile XGIF1STR _XGIF1;                                  /* XGATE Channel Interrupt Flag Vector 1 */
volatile XGIF2STR _XGIF2;                                  /* XGATE Channel Interrupt Flag Vector 2 */
volatile XGIF3STR _XGIF3;                                  /* XGATE Channel Interrupt Flag Vector 3 */
volatile XGIF4STR _XGIF4;                                  /* XGATE Channel Interrupt Flag Vector 4 */
volatile XGIF5STR _XGIF5;                                  /* XGATE Channel Interrupt Flag Vector 5 */
volatile XGIF6STR _XGIF6;                                  /* XGATE Channel Interrupt Flag Vector 6 */
volatile XGIF7STR _XGIF7;                                  /* XGATE Channel Interrupt Flag Vector 7 */
volatile XGPCSTR _XGPC;                                    /* XGATE Program Counter Register */
volatile XGR1STR _XGR1;                                    /* XGATE Register 1 */
volatile XGR2STR _XGR2;                                    /* XGATE Register 2 */
volatile XGR3STR _XGR3;                                    /* XGATE Register 3 */
volatile XGR4STR _XGR4;                                    /* XGATE Register 4 */
volatile XGR5STR _XGR5;                                    /* XGATE Register 5 */
volatile XGR6STR _XGR6;                                    /* XGATE Register 6 */
volatile XGR7STR _XGR7;                                    /* XGATE Register 7 */
volatile XGSEMSTR _XGSEM;                                  /* XGATE Semaphore Register */
volatile XGSWTSTR _XGSWT;                                  /* XGATE Software Trigger Register */


/* * * * *  32-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile XGVBR01STR _XGVBR01;                              /* XGATE Vector Base Address Register */

/* EOF */
